2.2.013/src/DataProcessors/МК_НастройкаВыгрузки/МК_НастройкаВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>МК_НастройкаВыгрузки</name>
</mdclass:DataProcessor>

2.2.013/src/InformationRegisters/ДанныеДляПодбораСотрудников/ДанныеДляПодбораСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8048febd-cf83-413d-8677-04e1f791040c">
  <name>ДанныеДляПодбораСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a5e069ee-7936-43e5-ba08-369cfef6082e">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="756ae0d9-f1d5-4f90-8a78-f9d59cf66bd0">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2348f956-2bde-41ca-a9ce-50267a8ad6a6">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51fb4128-5516-4c0d-9e12-c279879705d6">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/DataProcessors/МК_НастройкаВыгрузки/Forms/МК_ФормаВыбораСотрудников/Module.bsl
&НаСервере
Функция ЗавершениеВыбораНаСервере()   
	мТаб = ЭтаФорма.ВыборСотрудников;
	мСписВыб = Новый СписокЗначений;
	Для Каждого мСтрока ИЗ мТаб Цикл
		Если мСтрока.Выбор Тогда
			мСписВыб.Добавить(мСтрока.Сотрудник);
		КонецЕсли;	
	КонецЦикла;	
	//Константы.МК_СписокСотрудников.Установить(Новый ХранилищеЗначения(мСписВыб));
	Возврат мСписВыб;	
КонецФункции   

&НаКлиенте
Процедура ЗавершениеВыбора(Команда)
	мСписВыб = ЗавершениеВыбораНаСервере();   
	ЭтаФорма.Закрыть(мСписВыб);
КонецПроцедуры


&НаКлиенте
Процедура ОтменаВыбора(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции
	// Считаем настройки контактной информации.
	мВидКонтИнф = ОО.ПолучитьВидыКонтИнф(); // Это массив видов контактной информации 1С: 0 - Осн.Эл.Почта, 1 - Доп.Эл.Почта, 2 - Телефон 	
	// Получим список ранее выбранных сотрудников

	мСписВыб = Параметры.СписокВыбранных;
	// Теперь - список всех.
	Выборка = ПолучитьСписокСотрудников();   
	Выборка.Сортировать("Ссылка");
	мТаб = ЭтаФорма.ВыборСотрудников;	
	Для Каждого мСотр из Выборка Цикл   
		мНужен = Ложь;
		Если мСотр.ВАрхиве  ИЛИ НЕ ЗначениеЗаполнено(мСотр.Ссылка) // По датам приема/увольнения в запросе отсортировано.
			ИЛИ НЕ ЗначениеЗаполнено(мСотр.ОрганизацияСотрудника)
			ИЛИ мСотр.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;  
		
		мСписКонт = мСотр.КонтактнаяИнформация;   // Выбирать можно только сотрудников, имеющих "главную" почту
        Для Каждого ВыбКонт из мСписКонт Цикл 
			Если ВыбКонт.Вид = мВидКонтИнф[0] Тогда  // Это - вид главной почты.
				мНужен = Истина;
            КонецЕсли; 
		КонецЦикла;

		Если мНужен Тогда
			стрТаб = мТаб.Добавить();
			стрТаб.Сотрудник = мСотр.Ссылка;
			Если мСписВыб.НайтиПоЗначению(мСотр.Ссылка) = Неопределено Тогда
				стрТаб.Выбор = Ложь;
			Иначе
				стрТаб.Выбор = Истина; 
			КонецЕсли;	       
			стрТаб.Организация = мСотр.ОрганизацияСотрудника;
		КонецЕсли;	
	КонецЦикла;         
КонецПроцедуры


Функция ПолучитьСписокСотрудников()
	
	УстановитьПривилегированныйРежим(Истина);
	
	мЗапрос = Новый Запрос;
	//мЗапрос.УстановитьПараметр("Организации", СписокОрганизаций);
	//мЗапрос.УстановитьПараметр("ДатаОкончания", ТекущаяДата());  
	мЗапрос.УстановитьПараметр("ДатаНачала", ДобавитьМесяц(НачалоДня(ТекущаяДата()), 1)); 
	мЗапрос.УстановитьПараметр("ДатаОкончания",  ДобавитьМесяц(НачалоДня(ТекущаяДата()), -1)); 	  // Для увольнения - месяцем раньше. То есть если сотрудник уволен, он будет попадать
	              	                                                                              // в выборку целый месяц. Зачем?
	мЗапрос.Текст =  
		"ВЫБРАТЬ
		|	ДанныеДляПодбора.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДанныеДляПодбора.Начало) КАК Начало
		|ПОМЕСТИТЬ СрезДанных
		|ИЗ
		|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|ГДЕ
		|	ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)  // Только работающие
		|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
		|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&ДатаНачала, ДЕНЬ)
		|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&ДатаОкончания, ДЕНЬ))
		|
		|СГРУППИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДанныеДляПодбора.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СправочникСотрудники.Ссылка КАК Ссылка,
		|	СправочникСотрудники.ВАрхиве КАК ВАрхиве,
		|	ВЫБОР
		|		КОГДА ДанныеДляПодбора.Филиал = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
		|			ТОГДА ДанныеДляПодбора.Филиал
		|		ИНАЧЕ ДанныеДляПодбора.Организация
		|	КОНЕЦ КАК ОрганизацияСотрудника,
		|	СправочникСотрудники.ПометкаУдаления КАК ПометкаУдаления,
		|	ФизическиеЛица.КонтактнаяИнформация.(            // Для проверки наличия email
		|		Тип КАК Тип,
		|		Вид КАК Вид,
		|		Представление КАК Представление,
		|		ЗначенияПолей КАК ЗначенияПолей
		|	) КАК КонтактнаяИнформация
		|ИЗ
		|	СрезДанных КАК СрезДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
		|		ПО СрезДанных.Сотрудник = ДанныеДляПодбора.Сотрудник
		|			И СрезДанных.Начало = ДанныеДляПодбора.Начало
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК СправочникСотрудники
		|		ПО (ДанныеДляПодбора.Сотрудник = СправочникСотрудники.Ссылка)
		|			И (ДанныеДляПодбора.Наименование = СправочникСотрудники.Наименование)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
		|		ПО (ДанныеДляПодбора.ФизическоеЛицо = ФизическиеЛица.Ссылка)"; 
	
	РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[1].Выгрузить();
	Возврат Выборка;
КонецФункции
